ConnectTest/src/Enums/messageStatuses/messageStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>messageStatuses</name>
	<enumValues>
		<name>sent</name>
	</enumValues>
	<enumValues>
		<name>notSent</name>
	</enumValues>
	<enumValues>
		<name>delivered</name>
	</enumValues>
	<enumValues>
		<name>notDelivered</name>
	</enumValues>
	<enumValues>
		<name>read</name>
	</enumValues>
	<enumValues>
		<name>undefined</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/СIDMkg/Module.bsl
Функция sendSMS(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port,,,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "SmsService.svc/SendSms?login=" + Параметры.user + "&password=" + Параметры.password + "&phone=" + Параметры.phone + "&body=" + Параметры.text + "&senderName=" + Параметры.senderName;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.firstName = "string" Тогда
				ТекущийПуть = "string";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "string" Тогда
				sms_id = ЧтениеXML.Значение;
				ТекущийПуть = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Если sms_id <> "" Тогда
		Ответ.Вставить("id", sms_id);
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.sent);		
	Иначе
		Ответ.Вставить("error", "Сбой при отрправке Messages");		
	КонецЕсли;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция checkSmsStatus(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port,,,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "SmsService.svc/GetMessageState?login=" + Параметры.user + "&password=" + Параметры.password + "&messageid=" + Параметры.id;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.firstName = "Comment" Тогда
				ТекущийПуть = "Comment";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "Comment" Тогда
				ОтветСтатус = ЧтениеXML.Значение;
				ТекущийПуть = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Статус	= СтатусСообщения(ОтветСтатус);
	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.messageStatuses") Тогда
		Ответ.Вставить("messageStatus", Статус);
	Иначе
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);
		Ответ.Вставить("error","Неизвестный статус");
	КонецЕсли;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусСообщения(Статус)
	
	Если Статус = "В очереди" Или Статус = "sent" Или Статус = "Подготовлено" Или Статус = "Создано" Тогда
		Возврат Перечисления.messageStatuses.sent;
	ИначеЕсли Статус = "Отклонено" Тогда
		Возврат Перечисления.messageStatuses.notSent;
	ИначеЕсли Статус = "delivered" Тогда
		Возврат Перечисления.messageStatuses.delivered;
	ИначеЕсли Статус = "Не delivered" Или Статус = "Просрочено" Тогда
		Возврат Перечисления.messageStatuses.notDelivered;
	Иначе
		Возврат Статус;
	КонецЕсли;
	
КонецФункции
